{
  "selfIntroduction": "I majored in information management and digital content when I was studying. I was very interested in IT and user experience. I dared to accept and understand what is currently popular and emerging. I prefer to learn new things in a task-driven way.",
  "tudiTitle": "Taiwan Suwen Technology - Frontend Engineer",
  "tueiExperience1": "Mainly responsible for the functional development of all interface and process operation issues of the website, and participating in the functional design of the website and user services.",
  "tudiExperience2": "A special experience is to participate in the functional design and development of China's medical insurance, travel to the local area for system development and understand relevant policies when necessary.",
  "tudiExperience3": "From this entrepreneurial experience, I have experienced the work process of a small group, learned the predicament of the company's initial operation, and subsequently grown to a team of 15 people, learned the evaluation of the development schedule and work assignment, and need to pay regular attention to the status of team members. Understand that multi-person teams should place more emphasis on internal communication.",
  "cmuhTitle": "Information Department of CMUH - Fullstack Engineer",
  "cmuhExperience1": "Responsible for the development of the hospital administrative system and the drug management department system, and independently complete the front-end and back-end development logic and user demand interviews.",
  "cmuhExperience2": "Formulate the development process and specifications of the Angular front-end development framework for the information department, and write tools and documents.",
  "cmuhExperience3": "Develop common components for the development of Angular projects within the team.",
  "hyxenTitle": "Hyxen - R&D Assistant",
  "hyxenExperience1": "Complete the tasks assigned by the supervisor, such as statistics of product usage and user reviews, and production of weekly briefings to analyze product growth trends.",
  "hyxenExperience2": "Independently develop the backend of product statistics to provide the marketing team with rapid analysis of results.",
  "hyxenExperience3": "Develop Android APP (UBike station information query)",
  "projectSkill": "Use technology",
  "projectHint": "Implementation points",
  "projectTrail": "Development challenges",
  "projectBackground": "Project Background",
  "yunhisTitle": "HIS - Chinese clinic system",
  "yunhisSkill1": "The frontend uses the Angular framework and is developed with the Primeng UI kit",
  "yunhisSkill2": "The backend uses Java Spring architecture",
  "yunhisSkill3": "Database using MariaDB",
  "yunhisSkill4": "Use C# to develop Socket and Windows operating system to communicate with third-party developers",
  "yunhisHint1": "Use Angular lazy loading, Redis cache mechanism, and RabbitMQ transaction queuing mechanism to optimize user website experience",
  "yunhisHint2": "Make good use of Angular lint and Bitbucket Pipeline to reduce the cost of front-end development, deployment, and debugging",
  "yunhisHint3": "Integrate the common points of medical insurance rules and online transactions in all regions of China, and create common components, reducing the development time of medical insurance from 3 months to 4 weeks",
  "yunhisTrail1": "Habit differences: Due to the differences in operating habits of the display system in different cultures, the first and psychological understanding of the local area, the local language operation, and other problems encountered in the process of business trips.",
  "yunhisTrail2": "Geographical restrictions: Due to the physical isolation limitations of the network environment, the development of a medical insurance system requires the assistance of local Internet providers for remote development and debugging.",
  "yunhisImage1": "System login screen",
  "yunhisImage2": "doctor prescription screen",
  "soundManageTitle": "Woolito Asset Management System",
  "soundManageBackground": "This system is a sound material management website developed for animation studios. Originally, the studios used Dropbox to access and search files, but although the names are as distinguished as possible, there are still dozens of similar properties. It is a file, so I hope that you can quickly and effectively find the sound effects required by the animation by tagging the content, playing directly, and viewing the audio track map.",
  "soundManageSkill1": "The frontend uses the Angular framework, and wavesurfer.js is used to make sound effects previews and playback functions",
  "soundManageSkill2": "The backend uses Nodejs with Express framework",
  "soundManageSkill3": "Database using MySql",
  "soundManageSkill4": "In addition, the Dropbox API is used to manage the file storage function of sound files.",
  "soundManageTrail1": "ID non-unique value: the data content returned by the Dropbox API, the ID of different files may be repeated, and later changed to use the Dropbox file storage path as Unique, and modified the logic of the Database",
  "soundManageTrail2": "Dropbox API transaction timeout: When implementing the synchronization function or querying the data stored in Dropbox, the transaction times out due to too many transactions. Re-examine the query conditions and execute the program in different locations to ensure that the timeout will not be exceeded.",
  "soundManageImage1": "Sound effect list and view, play sound effect function",
  "soundManageImage2": "Sound effect upload function",
  "proposalManageBackground": "This functional requirement arises from the recent explosion of commercial proposals in animation studios, the speed of not adding proposals, and making the owners feel ingenious, so they are looking for a way to design content quickly and generate proposals after designing and playing content.",
  "proposalSkill1": "Frontend using Angular framework",
  "proposalSkill2": "The backend uses Nodejs with Express framework",
  "proposalSkill3": "Database using MySql",
  "proposalSkill4": "Use the Trello API to get Trello board data for developing static web pages",
  "proposalManageTrail1": "To avoid modifying the program structure and causing the proposed plan to be rearranged and confusing to the owner, it is necessary to save the content of the proposal in a non-real-time web page. Finally, two options are proposed:",
  "proposalManageTrail2": "Version control function: each time it is released, a new package of web page programs is generated and stored on the server, the old version is also set with a version number, and the newly released content is preset as the version currently viewed by the owner.",
  "proposalManageTrail3": "Export as PDF static content",
  "proposalManageImage1": "Trello settings screen",
  "proposalManageImage2": "Proposal upload and historical version view screen",
  "groupbuyTitle": "Group purchase backstage system",
  "grougbuyBackground": "Most Taiwanese consumers now use Line as a communication software. The owner said that major e-commerce companies have not yet provided the Line arrival notification function, which is quite troublesome for group purchase owners, and the monthly fee for e-commerce is quite high, and many functions are not used. , so I hope that there will be cooperative engineers to develop the notification system.",
  "groupbuySkill1": "Front-end development using Angular framework with Primeng UI kit",
  "groupbuySkill2": "Backend and database using Firebase",
  "groupbuySkill3": "Use Line Message API to complete customer arrival and payment notifications",
  "groupbuyTrail1": "Unclear requirements: Since many group purchases are now halfway through, and each group purchaser is learning, the initial requirements of the operation process of the invoicing system and other subsystems should be quite vague and inconsistent with the business management process, and it takes a lot of time to guide and Discuss what the actual function looks like.",
  "groupbuyTrail2": "Firebase data maintenance methods are different: due to the non-traditional use of relational databases, syntax and query logic need to be paid more attention. For example, array in limits its conditions to a maximum of 10.",
  "groupbuyTrail3": "Line API: The pricing method of Line Message API is the number of messages. In order to control the number of messages sent, it is necessary to redesign the timing of message sending, and change the starting point of sending messages from the starting point of designing according to orders to the starting point of designing according to consumers.",
  "groupbuyImage1": "Group arrival list interface (Not real data)",
  "groupbuyImage2": "Customer pickup interface (Not real data)"
}